charactors = {
    'අ': 'a', 'ආ': 'aa', 'ඇ': 'A', 'ඉ': 'i', 'ඊ': 'ii', 'උ': 'u', 'ඍ': 'Ru', 'එ': 'e', 'ඔ': 'o', 'ක': 'k', 'ග': 'g', 'ච': 'ch',
    'ජ': 'j', 'ට': 't', 'ඩ': 'd', 'න': 'n', 'ප': 'p', 'බ': 'b', 'ල': 'l', 'ද': 'd', 'ව': 'w', 'ශ': 'sh',
    'භ': 'bh', 'ස': 's', 'හ': 'h', 'ය': 'y', 'ර': 'r', 'ම': 'm', 'ත': 'th', 'ඛ': 'kh', ' ': ' ', 'ඳ': 'dn',
    'උ': 'u', 'ඌ': 'uu', 'ඕ': 'oo', 'ඔ': 'o', 'ඖ': 'au', 'ඞ': 'ng', 'ඟ': 'gn', 'ඡ': 'chh', 'ඣ': 'jh',
    'ඍ': 'R', 'ඎ': 'Ru', 'ඏ': 'A', 'ඐ': 'aa', 'ෆ': 'fa',
    'ච': 'ch', 'ජ': 'j', 'ඩ': 'd', 'ළ': 'L', 'ණ': 'N', 'ධ': 'dhh', 'ඤ': 'zk', 'ඥ': 'zh',
    'ෂ': 'S', 'හෝ': 'Sh', 'ෆ': 'a', 'ඹ': 'B', 'ළු': 'L', 'ඟ': 'zg', 'ඦ': 'zja', 'ඬ': 'zd', 'හෝ': 'q',
    'ඥ': 'zh', 'ය': 'y', 'හෝ': 'A', 'හෝ': 'o', 'හෝ': 'v', 'හෝ': 'f', 'හෝ': 'Sh',
    'ඈ': 'Aa', 'ඌ': 'uu','ඎ': 'Ruu','ඒ': 'ee', 'ඓ': 'Ee', 'ඕ': 'O', 'ඖ': 'Ou'
}


pillam = {
    'ා': 'aa', 'ැ': 'A', 'ෑ': 'Aa', 'ි': 'i', 'ී': 'ii', 'ු': 'u', 'ූ': 'uu', 'ෘ': 'ru', 'ෙ': 'e', 'ේ': 'ee', 'ෛ': 'ai',
    'ො': 'o', 'ෝ': 'oo', 'ෞ': 'au',
    '්‍ය': 'ya', '්‍ර': 'ra' , '්': ' '
}

vowels = ['අ', 'ආ', 'ඇ', 'ඈ', 'ඉ', 'ඊ', 'උ', 'ඌ', 'ඍ', 'ඎ', 'ඏ', 'ඐ', 'එ', 'ඒ', 'ඓ', 'ඔ', 'ඕ', 'ඖ']
